koala/app/controllers/projects_controller.rb

INSERT INTO "projects" ("author", "created_at", "updated_at", "contributers", "title", "modified_at", "code", "published_at") VALUES ('Nick Pachulski', '2011-06-17 14:15:43.192731', '2011-06-17 14:15:43.192731', NULL, 'This is a test', '2011-06-17 14:15:43.191962', 'say ''hello world!'';', '2011-06-17 14:15:43.191871')
---
	def create
		@project = Project.new(params[:project])
		@project.author = 'Nick Pachulski'				#FIX LATER WHEN USER SYS IS UP
		@project.published_at = Time.now
		@project.modified_at = Time.now
		if @project.save