koala/app/controllers/users_controller.rb

	def create
		@user = User.new(params[:user])
		@p2 = params[:p2]

		if( @user.password != @p2 )
			render :action => 'new'
		else

			@user.join_date = Time.now
			if @user.save
---
INSERT INTO "users" ("created_at", "email", "username", "updated_at", "join_date", "password") VALUES ('2011-06-17 14:54:15.847274', 'nmpach@gmail.com', 'brodeur235', '2011-06-17 14:54:15.847274', '2011-06-17 14:54:15.846666', 'nicholas')